In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df=pd.read_csv('sales.csv')
print(df.head())

   Product_ID     Month_sales Sales_Rep Region    Total  Quantity_Sold  \
0        1052   February 2023       Bob  North  5053.97             18
1        1093      April 2023       Bob   West  4384.02             17
2        1015  September 2023     David  South  4631.23             30
3        1072     August 2023       Bob  South  2167.94             39
4        1061      March 2023   Charlie   East  3750.20             13

  Product_Name  Unit_Cost    Price Customer_Type  Discount Payment_Method  \
0    Furniture     152.75   267.22     Returning      0.09           Cash
1    Furniture    3816.39  4209.44     Returning      0.11           Cash
2         Food     261.56   371.40     Returning      0.20  Bank Transfer
3     Clothing    4330.03  4467.75           New      0.02    Credit Card
4  Electronics     637.37   692.71           New      0.08    Credit Card

  Sales_Channel Region_and_Sales_Rep
0        Online            North-Bob
1        Retail             West-Bob
2        Retail          South-David
3        Retail            South-Bob
4        Online         East-Charlie

In [ ]:
top_5_products = df.groupby('Product_Name')['Quantity_Sold'].sum().nlargest(5)
display(top_5_products)

Product_Name
Clothing       6922
Furniture      6729
Electronics    6096
Food           5608
Name: Quantity_Sold, dtype: int64